Autodesk.Revit.DB.Mechanical.DuctSizeSettings.GetEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.Mechanical.DuctSizeSettings.GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.Mechanical.DuctSizeSettings.GetDuctSizeSettingsIterator
Returns a DuctSizeSettingIterator to the duct size settings.
Since:
2013

Autodesk.Revit.DB.Mechanical.DuctSizeSettings.RemoveSize(Autodesk.Revit.DB.Mechanical.DuctShape,System.Double)
Erase the existing MEPSize with this nominal diameter. The duct shape determines the location of the size in the size table.
Remarks:
Does nothing if there is no existing MEPSize with this nominal diameter.
shape:
The shape of duct.
nominalDiameter:
Nominal diameter.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Throws if the function is called during iterating the size set.
Since:
2013

Autodesk.Revit.DB.Mechanical.DuctSizeSettings.AddSize(Autodesk.Revit.DB.Mechanical.DuctShape,Autodesk.Revit.DB.MEPSize)
Inserts a new MEPSize in to the duct size settings. The duct shape determines the location of the new size in the size table.
shape:
The shape of duct.
sizeInfo:
The new MEPSize to be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Throws if there is no size set determined by the duct shape
or  there is already the same size in the size set determined by the duct shape.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Throws if the function is called during iterating the size set.
Since:
2013

Autodesk.Revit.DB.Mechanical.DuctSizeSettings.GetDuctSizeSettings(Autodesk.Revit.DB.Document)
Get the duct size settings of the project.
aDoc:
The document.
Returns:
The duct size settings of the project.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Mechanical.DuctSizeSettings.GetSizeCount(Autodesk.Revit.DB.Mechanical.DuctShape)
Get the size count of the duct size table. The duct shape determines the location of the size in the size table.
shape:
The shape of duct.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.Mechanical.DuctSizeSettings.default(Autodesk.Revit.DB.Mechanical.DuctShape)
Get the DuctSizes for this DuctShape.
ductShape:
The duct shape.
Returns:
The DuctSizes for this DuctShape.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There is no DuctSizes for this DuctShape.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Mechanical.DuctSizeSettings.GetDuctSizeSettingIterator
Returns a DuctSizeSettingIterator object that iterates through the collection.
Returns: A DuctSizeSettingIterator object that can be used to iterate through key-value pairs in the collection.

Autodesk.Revit.DB.Mechanical.DuctSizeSettings
Duct sizes settings
Since:
2013